[
  {
    "id": 1,
    "studentsName":"Lesya",
    "studentsFeedback": "Здравствуйте, Анатолий! На проектах, где я работала Unity разработчиком не применяли unit-тестирование. Несколько раз я пыталась самостоятельно освоить и внедрить в работу unit-тесты. Я столкнулась с неочевидной сложностью в изучении в этой темы: делают ли так в настоящей практике или это пример ради примера, «игрушечный» пример? Конечно же, когда я узнала, что будет ваш курс - поспешила записаться. Курс мне нравится, жаль, что прошла уже большая его часть, а значит, он скоро закончится. Когда я смотрю урок, пытаюсь писать синхронно с лектором или с небольшими паузами. Сегодня, когда я делала домашнее задание, поняла, что это не очень эффективный подход — материал плохо усваивается при таком мгновенном конспектировании, но и пересматривать одно и то же несколько раз себя не заставишь. Возможно, было бы лучше коммитить  написанный вами код, но давать самостоятельную работу, как в 6-м уроке? Было бы здорово, если бы к урокам вы давали ссылки для самостоятельного изучения, бесценно, когда опытный программист делится своим списком литературы! С большим вниманием слушаю ваши отсылки касающиеся  .NET как такового. Я все еще не очень понимаю, что, где и когда стоит покрывать unit-тестами, но уже начинаю понимать, как. Мне предстоит чинить некоторые баги в своем коде, постараюсь последовать вашему совету и применить unit-тесты в этих местах. Спасибо, что делитесь своим опытом! Олеся П.",
    "studentsDate":"2021",
    "studentPackage": "Vanilla"
  },
  {
    "id": 2,
    "studentsName":"Kirill",
    "studentsFeedback":"Это уже третий курс от синдикатов, который я беру и каждый раз я безмерно рад) Предыдущие два раза мои отзывы попадали на страницу курса и в этот раз  я тоже планирую оказаться в графе отзывы. Я пытался сам разобраться в теме юнит тестирования, но я не знал откуда подчеркнуть нюансы и бест практики. Этот курс затрагивает буквально все базовые принципы, понимание которых даёт возможность писать самые разнообразные тесты. Я убежден, что каждый, кто пройдет 3-4 первых урока сможет не просто писать юнит тесты, а буквально наслаждаться процессом тестирования. Прохождение курса гарантирует новый уровень в, как я теперь понимаю, необходимом навыке тестирования. Этот курс буквально концентрат опыта и знаний, который благодаря отличной подаче Анатолия, усваивается очень легко плодотворно и навсегда) Я буквально получил инструкцию для пальцев как им писать тесты а мне в этот момент наслаждаться процессом) Я буквально испытываю восторг, когда замечательный Анатолий делится очередным ценнейшим кусочком своего опыта и рассказывает важнейшие нюансы тестирования на самостоятельное познание которых у меня ушли бы годы. В общем, я в восторге, остро рекомендую для прохождения. 11/10 must have. Притензия к курсу, что он появился впервые аж в 2020 году! Мог бы появиться и пораньше!! Притензий больше нет :)",
    "studentsDate":"2021",
    "studentPackage": "Standart"
  },
  {
    "id": 3,
    "studentsName":"Jewelz",
    "studentsFeedback":"Анатолий, приветствую! Даю фидбек после прохождения первой половины курса UnitTesting. Пару слов о себе: - программирую на as3 с 2010 года, в основном как фрилансер и программист самоучка, с 2018 года работаю в геймдев компании из которых весь 2021 год на мобильном проекте (юнити, c#). Ни юнити, ни c# до этого момента не трогал, поэтому считаю себя в нем еще новичком, юнит тестов до этого не касался. Впечатления: - курс хорошо структурирован и разбит на уроки, нет перенасыщения информации, либо ее недостатка - очень качественная подача: урок просто интересно и приятно слушать! - хороший тайминг курсов, уроки не более 1 часа, что с рабочей загрузкой вполне достаточно - удобное время для онлайн фидбеков - очень нравится, что затрагиваются (и не только затрагиваются, но и подробно объясняются) темы, которые лишь касаются тестов, но напрямую с ними не связаны, это очень приятно и познавательно, особенно для меня, как не очень опытного в целом юнити-разработчика: установка плагинов в rider, работа с nuget в юнити и др. - очень нравится подход к урокам: научить гуглить это очень полезно в том плане, что учишься понимать подход к разработке, а не просто скачать dll и все заработает, и это ощущается на всем протяжении курса - очень полезны онлайн фидбеки, крайне рекомендую всем выбор в пользу именно этого пакета, т.к. кажется, что чуть ли не половина полезных знаний (а может и большая часть) приходит именно с разбором домашних работ. Комментарии:- очень понравился формат уроков с необязательными заданиями, когда есть пространство для самостоятельной работы и творчества, хочется больше видеть таких заданий - хочется видеть, какие нажаты кнопки во время урока (как в уроке с ace jump), есть плагины, которые будут сами это показывать. Очень рад, что записался на данный курс, даже не досмотрев его до конца, уже не понимаю, как раньше жил без какого-либо юнит-тестирования! Впечатления только положительные! Буду рекомендовать сам курс и тебя, Анатолий, как прекрасного лектора!",
    "studentsDate":"2021",
    "studentPackage": "Standart"
  }
]