[
  {
    "id": 1,
    "studentsName":"fluid",
    "studentsFeedback": "I've already had the pleasure of taking courses from K-Syndicate, particularly two years ago when I took part in the Architecture Vanilla course and was absolutely thrilled with it! I already had a pretty good idea of what to expect from the new course. But I was even more impressed than I thought I'd be! For me, the most important thing is a well-planned structure from start to finish. This is exactly what you need for effective learning when you move from simple concepts to full-fledged production solutions. The lecturers planned each next step in the presentation of the material really carefully, which allows you to systematically integrate the necessary techniques to solve real problems. I found the examples of solutions using different approaches particularly useful, as it helps you to better understand the problem and have several solutions in your inventory. I'm thrilled to share that this was my first course with the Standard modifier. It was an incredible opportunity to gain invaluable insights from the lecturers as we reviewed code. The atmosphere was electric, with a dynamic mix of brilliant lecturers and engaged students. It was a fantastic experience! You are absolutely amazing at what you do, and your input is so valuable! I can’t wait to hear more from your amazing team! Best regards, Dmytro👾",
    "studentsDate":"2024",
    "studentPackage": "Standart"
  },
  {
    "id": 2,
    "studentsName":"Andrew U.",
    "studentsFeedback": "От обучения остались только положительные эмоции и кладезь знаний по правильной и удобной работе с миром ECS в Unity. Поясняется не только как делать, но и почему именно так, какие плюсы и минусы в разных вариантах решения. Алексей и Екатерина «горят» за каждого человека и помогают разобраться во всех вопросах. Лучше обучающего материала по ECS вы не найдете. Майндшифт обеспечен!",
    "studentsDate":"2024",
    "studentPackage": "Standart"
  },
  {
    "id": 3,
    "studentsName":"Bogenbai",
    "studentsFeedback": "Даже имея коммерческий опыт в ECS и фреймворке данный курс дал дополнительные решения, инструменты и майндшифт, которого мне не хватало. Если вы хотите научиться делать правильный ECS и получать от этого удовольствие, то лучше этого курса вам будет крайне сложно найти, если вообще не невозможно. Курс - бомба. Я ждал его джва года и он оправдал все мои ожидания. Было супер весело и супер информативно",
    "studentsDate":"2024",
    "studentPackage": "Standart"
  },
  {
    "id": 4,
    "studentsName":"yehor",
    "studentsFeedback": "Я изначально купил ванилку по ECS, потому что понимал, что не буду успевать и что до этого все курсы, которые у вас есть, я проходил на ванилке, материал очень хорошо изложен, критичных дополнительных вопросов не оставалось. А потом знакомый закончил первый поток по ECS и я думаю, а почему бы не записаться, даже не делая домашку, всё равно что-то полезное услышишь, плюс хотелось хоть как-то познакомиться, потому что буквально до этого 2 месяца только вас и смотрел почти каждый день) По ECS. Абсолютно ничего не знал, и эти слова казались чем-то страшным и непонятным. Как раз паралельно с началом курса начал делать свой новый проект. Пока решал задачи по проекту, то возникали вопросы, а на видео находились ответы на вопросы, поэтому даже перед встречей сам отвечал на свои вопросы. А последние уроки уже когда смотрелись, то было понятно как решать задачу, поэтому полностью осмысленно погрузился в этот подход. В общем я не знаю, где ещё можно было бы столько узнать полезного по ECS, что сразу же использовать его на проекте, не изобретать велосипед и вообще наслаждаться от этого подхода. Буквально бесценные курсы. Столько опыта, который хорошо структурирован и по теме, по которой я даже не знаю где найти вот такой материал. Я работал в компании, потом работал на себя, и потом мне хотелось посмотреть, а как же другие пишут, я взял перерыв, просмотрел буквально всё что у вас есть на ютубе и на курсах. Потом прошёл в компанию, как хотел, чтобы большая, интересный проект. Понял, что везде все одинаково, и пошёл дальше пилить свои проекты. Поэтому вы даже не можете представить, насколько это полезные знания и какие они ауткам дают. Так что релиз следующей игры, вы внесли свою часть в её успех",
    "studentsDate":"2024",
    "studentPackage": "Standart"
  },
  {
    "id": 5,
    "studentsName":"chastan (Константин)",
    "studentsFeedback": "Спасибо вам огромное за ваши курсы! Для меня это уже второй курс. Пусть это только курсы по улучшению хардов, но кроме улучшения хард скилов на этих курсах я смог выявить проблемы в софт скилах и уже решаю эти проблемы. Кроме всего прочего благодаря этим курсам смог улучшить коммуникацию в команде на работе, когда обсуждали некоторые моменты обучения. В общем спасибо вам огромное еще раз!",
    "studentsDate":"2024",
    "studentPackage": "Standart"
  },
  {
    "id": 6,
    "studentsName":"AndriiFilatov",
    "studentsFeedback": "Спасибо за курс, очень понравилось. Позволяет быстро погрузиться в мир ECS и расширить свои знания в data oriented programming.",
    "studentsDate":"2024",
    "studentPackage": "Standart"
  },
  {
    "id": 7,
    "studentsName":"altum",
    "studentsFeedback": "Курс - восторг! У Синдикатов вообще высочайший уровень обучающих материалов. И курс по ECS не исключение, если не сказать больше. Качество материала, способность его грамотно подать, научить думать как нужно - это то, что реально умеют делать Екатерина и Алексей. А ECS - это особенно та тема, где нужно научиться мыслить по-другому. И этот курс реально вас этому научит. Причем не через боль и страдания, а через приятное чувство предвкушения и покалывание на кончиках пальцев, которыми вы будете с нетерпением писать код вашей домашки. Авторы курса максимально вовлечены в процесс обучения своих студентов. Они всегда готовы подсказать, рассказать, объяснить и обсудить вопросы как по теме курса, так и за ее пределами. Курс нереально бустит ваши скиллы и очень вовлекает. Только здесь можно увидеть, как группа проходит весь курс от начала и до конца в полном составе и без отвалов.",
    "studentsDate":"2024",
    "studentPackage": "Standart"
  },
  {
    "id": 8,
    "studentsName": "Михаил",
    "studentsFeedback": "Учился на первом потоке с проверками домашек. До этого не изучал и не пробовал другие ECS решения и не пожалел. Курс закладывает уверенную базу для мышления данными. После майндшифта начинаешь по другому смотреть на структуру игр. Обратно в ООП уже не хочется. Помимо самого ECS и как его сварить на курсе рассказывают как структурировать проект, настраивать кодогенерацию и проектировать небольшим скоупом. Отдельно хочется отметить высокий уровень C# - в курсе будет много моментов интересного использования возможностей языка. Домашки интересные, местами сложные, советую выделять на них значительное время. Все работы рассматриваются и обсуждаются. Рекомендую проходить после Архитектуры.",
    "studentsDate": "2024",
    "studentPackage": "Standart"
  }
]